app/controllers/school_classes_controller.rb

	def create
		school_class = SchoolClass.new(school_class_params(:title, :room_number))
		school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Dog Grooming"], ["room_number", 9], ["created_at", "2020-05-22 00:38:09.629656"], ["updated_at", "2020-05-22 00:38:09.629656"]]

	def update
		school_class = SchoolClass.find(params[:id])
		school_class.update(school_class_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "TensorFlow II"], ["updated_at", "2020-05-22 00:40:30.355836"], ["id", 4]]