app/controllers/students_controller.rb

    def create
     @student = Student.new(params.require(:student).permit(:first_name, :last_name))
     @student.first_name = params[:student][:first_name]
     @student.last_name = params[:student][:last_name]
     @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Sandra"], ["last_name", "Veach"], ["created_at", "2020-05-22 00:17:22.598350"], ["updated_at", "2020-05-22 00:17:22.598350"]]

    def update
      @student = Student.find(params[:id])
      @student.update(first_name: params[:student][:first_name], last_name: params[:student][:last_name])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Daniel"], ["updated_at", "2020-05-22 00:26:54.911072"], ["id", 3]]